swift-embedded/stm32/Keil.STM32F4xx_DFP.2.13.0/MDK/Boards/ST/STM32F429I-Discovery/emWin/Example/RTE/Graphics_Display/STM32F429ZITx/LCDConf.c
  GUI_USE_PARA(OffFG);
  GUI_USE_PARA(OffDest);
  for (y = 0U; y < ySize; y++) {
    //
    // Invert alpha values
    //
    _InvertAlpha(pFG, _pBuffer_FG, xSize);
    _InvertAlpha(pBG, _pBuffer_BG, xSize);
    //
    //
    //
    _DMA_MixColorsBulk(_pBuffer_FG, _pBuffer_BG, _pBuffer_DMA2D, Intens, xSize);
    //
    //
    //
    _InvertAlpha(_pBuffer_DMA2D, pDst, xSize);
    pFG  += xSize + OffFG;
    pBG  += xSize + OffBG;
    pDst += xSize + OffDest;
  }
}

/*********************************************************************
*
*       ILI934 Registers
*
*********************************************************************
*/
#define ILI9341_SLEEP_OUT       0x11    // Sleep out register
#define ILI9341_GAMMA           0x26    // Gamma register
#define ILI9341_DISPLAY_OFF     0x28    // Display off register
#define ILI9341_DISPLAY_ON      0x29    // Display on register
#define ILI9341_COLUMN_ADDR     0x2A    // Column address register
#define ILI9341_PAGE_ADDR       0x2B    // Page address register
#define ILI9341_GRAM            0x2C    // GRAM register
#define ILI9341_MAC             0x36    // Memory Access Control register
#define ILI9341_PIXEL_FORMAT    0x3A    // Pixel Format register
#define ILI9341_WDB             0x51    // Write Brightness Display register
#define ILI9341_WCD             0x53    // Write Control Display register
#define ILI9341_RGB_INTERFACE   0xB0    // RGB Interface Signal Control
#define ILI9341_FRC             0xB1    // Frame Rate Control register
#define ILI9341_BPC             0xB5    // Blanking Porch Control register
#define ILI9341_DFC             0xB6    // Display Function Control register
#define ILI9341_POWER1          0xC0    // Power Control 1 register
#define ILI9341_POWER2          0xC1    // Power Control 2 register
#define ILI9341_VCOM1           0xC5    // VCOM Control 1 register
#define ILI9341_VCOM2           0xC7    // VCOM Control 2 register
#define ILI9341_POWERA          0xCB    // Power control A register
#define ILI9341_POWERB          0xCF    // Power control B register
#define ILI9341_PGAMMA          0xE0    // Positive Gamma Correction register
#define ILI9341_NGAMMA          0xE1    // Negative Gamma Correction register
#define ILI9341_DTCA            0xE8    // Driver timing control A
#define ILI9341_DTCB            0xEA    // Driver timing control B
#define ILI9341_POWER_SEQ       0xED    // Power on sequence register
#define ILI9341_3GAMMA_EN       0xF2    // 3 Gamma enable register
#define ILI9341_INTERFACE       0xF6    // Interface control register
#define ILI9341_PRC             0xF7    // Pump ratio control register

#define ILI9341_WriteReg(reg)   LCD_X_Write0_8(reg)
#define ILI9341_WriteData(data) LCD_X_Write1_8(data)

/*********************************************************************
*
*       _InitIL9341
*
* Purpose:
*   Initializes the IL9341 controller
*/
static void _InitIL9341(void) {

  /* Configure LCD */
  ILI9341_WriteReg (0xCA);
  ILI9341_WriteData(0xC3);
  ILI9341_WriteData(0x08);
  ILI9341_WriteData(0x50);
  ILI9341_WriteReg (ILI9341_POWERB);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0xC1);
  ILI9341_WriteData(0x30);
  ILI9341_WriteReg (ILI9341_POWER_SEQ);
  ILI9341_WriteData(0x64);
  ILI9341_WriteData(0x03);
  ILI9341_WriteData(0x12);
  ILI9341_WriteData(0x81);
  ILI9341_WriteReg (ILI9341_DTCA);
  ILI9341_WriteData(0x85);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x78);
  ILI9341_WriteReg (ILI9341_POWERA);
  ILI9341_WriteData(0x39);
  ILI9341_WriteData(0x2C);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x34);
  ILI9341_WriteData(0x02);
  ILI9341_WriteReg (ILI9341_PRC);
  ILI9341_WriteData(0x20);
  ILI9341_WriteReg (ILI9341_DTCB);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x00);
  ILI9341_WriteReg (ILI9341_FRC);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x1B);
  ILI9341_WriteReg (ILI9341_DFC);
  ILI9341_WriteData(0x0A);
  ILI9341_WriteData(0xA2);
  ILI9341_WriteReg (ILI9341_POWER1);
  ILI9341_WriteData(0x10);
  ILI9341_WriteReg (ILI9341_POWER2);
  ILI9341_WriteData(0x10);
  ILI9341_WriteReg (ILI9341_VCOM1);
  ILI9341_WriteData(0x45);
  ILI9341_WriteData(0x15);
  ILI9341_WriteReg (ILI9341_VCOM2);
  ILI9341_WriteData(0x90);
  ILI9341_WriteReg(ILI9341_MAC);
  ILI9341_WriteData(0xC8);
  ILI9341_WriteReg (ILI9341_3GAMMA_EN);
  ILI9341_WriteData(0x00);
  ILI9341_WriteReg (ILI9341_RGB_INTERFACE);
  ILI9341_WriteData(0xC2);
  ILI9341_WriteReg (ILI9341_DFC);
  ILI9341_WriteData(0x0A);
  ILI9341_WriteData(0xA7);
  ILI9341_WriteData(0x27);
  ILI9341_WriteData(0x04);

  /* Column address set */
  ILI9341_WriteReg (ILI9341_COLUMN_ADDR);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0xEF);

  /* Page address set */
  ILI9341_WriteReg (ILI9341_PAGE_ADDR);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x01);
  ILI9341_WriteData(0x3F);
  ILI9341_WriteReg (ILI9341_INTERFACE);
  ILI9341_WriteData(0x01);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x06);

  ILI9341_WriteReg (ILI9341_GRAM);
  GUI_Delay(200);

  ILI9341_WriteReg (ILI9341_GAMMA);
  ILI9341_WriteData(0x01);

  ILI9341_WriteReg (ILI9341_PGAMMA);
  ILI9341_WriteData(0x0F);
  ILI9341_WriteData(0x29);
  ILI9341_WriteData(0x24);
  ILI9341_WriteData(0x0C);
  ILI9341_WriteData(0x0E);
  ILI9341_WriteData(0x09);
  ILI9341_WriteData(0x4E);
  ILI9341_WriteData(0x78);
  ILI9341_WriteData(0x3C);
  ILI9341_WriteData(0x09);
  ILI9341_WriteData(0x13);
  ILI9341_WriteData(0x05);
  ILI9341_WriteData(0x17);
  ILI9341_WriteData(0x11);
  ILI9341_WriteData(0x00);
  ILI9341_WriteReg (ILI9341_NGAMMA);
  ILI9341_WriteData(0x00);
  ILI9341_WriteData(0x16);
  ILI9341_WriteData(0x1B);
  ILI9341_WriteData(0x04);
  ILI9341_WriteData(0x11);
  ILI9341_WriteData(0x07);
  ILI9341_WriteData(0x31);
  ILI9341_WriteData(0x33);
  ILI9341_WriteData(0x42);
  ILI9341_WriteData(0x05);
  ILI9341_WriteData(0x0C);
  ILI9341_WriteData(0x0A);
  ILI9341_WriteData(0x28);
  ILI9341_WriteData(0x2F);
  ILI9341_WriteData(0x0F);

  ILI9341_WriteReg (ILI9341_SLEEP_OUT);
  GUI_Delay(200);

  ILI9341_WriteReg (ILI9341_DISPLAY_ON);
  ILI9341_WriteReg (ILI9341_GRAM);
}

/*********************************************************************
*
*       _LCD_DisplayOn
*/
static void _LCD_DisplayOn(void) {
  //
  // Display On
  //
  __HAL_LTDC_ENABLE(&LTDC_Handle);
  ILI9341_WriteReg (ILI9341_DISPLAY_ON);
}

/*********************************************************************
*
*       _LCD_DisplayOff
*/
static void _LCD_DisplayOff(void) {
  //
  // Display Off
  //
  __HAL_LTDC_DISABLE(&LTDC_Handle);
  ILI9341_WriteReg (ILI9341_DISPLAY_OFF);
}

/*********************************************************************
*
*       _LCD_InitController
*/
static void _LCD_InitController(int LayerIndex) {
  LTDC_LayerCfgTypeDef LayerCfg;
  unsigned int         i;
  int                  xSize, ySize, BitsPerPixel;
  static int           Initialized = 0;

